-- +goose Up
-- +goose StatementBegin
-- 서울 7개, 부산 3개, 대구 3개, 인천 3개, 수원 3개, 기타 4개 SO
INSERT INTO catv.dist_so_weather_mapping (so_nm, weather_location, province) VALUES
('도봉강북', '서울', '서울특별시'),
('강서방송', '서울', '서울특별시'),
('광진성동', '서울', '서울특별시'),
('동대문방송', '서울', '서울특별시'),
('노원방송', '서울', '서울특별시'),
('서대문방송', '서울', '서울특별시'),
('종로중구', '서울', '서울특별시'),
('서부산방송', '부산', '부산광역시'),
('낙동방송', '부산', '부산광역시'),
('동남방송', '부산', '부산광역시'),
('대경방송', '대구', '대구광역시'),
('대구방송', '대구', '대구광역시'),
('티씨엔방송', '대구', '대구광역시'),
('남동방송', '인천', '인천광역시'),
('새롬방송', '인천', '인천광역시'),
('서해방송', '인천', '인천광역시'),
('수원방송', '수원', '경기도'),
('기남방송', '수원', '경기도'),
('ABC방송', '수원', '경기도'),
('전주방송', '전주', '전라북도'),
('세종방송', '세종', '세종특별자치시'),
('중부방송', '세종', '세종특별자치시'),
('한빛방송', '광주', '광주광역시');
-- +goose StatementEnd

-- +goose Down